# coding=utf-8

# 代表从1到5(不包含5) [1, 2, 3, 4]
print range(1, 5)

# 代表从1到5，间隔2(不包含5) [1, 3]
print range(1, 5, 2)

# 代表从0到5(不包含5) [0, 1, 2, 3, 4]
print range(5)

array = [1, 2, 5, 3, 6, 8, 4]
# 其实这里的顺序标识是
#[1, 2, 5, 3, 6, 8, 4]
#(0，1，2，3，4，5，6)
#(-7, -6, -5, -4, -3, -2, -1)

# 列出0以后的
print array[0:]

# 列出1以后的
print array[1:]

# 列出-1之前的
print array[:-1]

# 列出3到-3之间的(不含-3)
print  array[3:-3]

# 全部复制
print array[::]

# 打印0,2,4下标为偶数的元素
print array[::2]

# 打印下表从2开始的各元素
print array[2::]

# 从头开始每三个打印一次元素
print array[::3]

# 颠倒列表
print array[::-1]

# 冒泡算法
array = [1, 2, 5, 3, 6, 8, 4]
for i in range(len(array) - 1, 0, -1):
	print i
	for j in range(0, i):
		print j
		if array[j] > array[j + 1]:
			array[j], array[j + 1] = array[j + 1], array[j]
print array

#
# 1：array = [1, 2, 5, 3, 6, 8, 4]
# 一个乱序的list没什么好解释的
#
# 2：for i in range(len(array) - 1, 0, -1):
# 意思是从6到1间隔 - 1, 也就是倒序range(2, 7, -1), 随后把这些值循环赋给i，
# 那么i的值将会是[6, 5, 4, 3, 2]
#
# 3：for j in range(0, i): 这是一个循环赋值给j，j的值将会是[0, 1, 2, 3, 4, 5][0, 1, 2, 3, 4][0, 1, 2, 3][0, 1, 2][0, 1]
# 那么上边两个循环嵌套起来将会是
#
# i - -----------6
# j - -----------0j - -----------1j - -----------2j - -----------3j - -----------4j - -----------5
#
# i - -----------5
# j - -----------0j - -----------1j - -----------2j - -----------3j - -----------4
# i - -----------4
# j - -----------0j - -----------1j - -----------2j - -----------3
# i - -----------3
# j - -----------0j - -----------1j - -----------2
# i - -----------2
# j - -----------0j - -----------1
#
# 4：if array[j] > array[j + 1]:
# array = [1, 2, 5, 3, 6, 8, 4]
# 其实·就是使用这个把这个没有顺序的array = [1, 2, 5, 3, 6, 8, 4]排序

# 5：array[j], array[j + 1] = array[j + 1], array[j]
# 替换赋值,打印出来

